// miniprogram/pages/question/index.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    questions: [{
        content: '本平台提供参与抽奖的公共平台，活动奖品由本平台提供并发放，本平台承诺抽奖公平公正公开，绝不弄虚作假，营造良好的平台使用环境。'
      },
      {
        content: '参与抽奖的过程中，如用户出现违规行为（如利用黑客工具，软件作弊等），本平台有权取消用户中奖资格。'
      }, {
        content: '本平台会在开奖结果页面展示中奖用户的头像和中奖资格。'
      },
      {
        content: '本平台会在开奖结果页面展示中奖用户的头像和中奖资格。'
      },
      {
        content: '开奖后，中奖用户需主动联系客服领取奖品，超过三天未领奖则视为自动放弃该奖品。'
      },
      {
        content: '抽奖期间发生任何不可抗力事件使本抽奖活动或本次抽奖目的不能实现，本平台因此免责。不可抗力是指不能控制、不可预见或不能避免，即使预见亦无法避免的事件，该事件使任何一方根据本协议履行其全部或部分义务已不可能。包括社会异常事件，自然灾害或政府管制行为而造成的网络关闭等非本平台过错的行为。'
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})